app/Controllers/Pdf/PdfController.php

    public function perkategori()
    {
        $modelKategori = new DocumentCategorieModel();
        $documents = $modelKategori->findAll();
---
SELECT *
FROM `documentcategories`

    public function tanggal()
    {

        $tanggal = $this->request->getPost('tanggal');
        $dompdf = new Dompdf();
        $modelSubmision = new SubmissionModel();

        $submission = $modelSubmision->getWithDocuments()
            ->where('submissions.created_at >=', $tanggal . ' 00:00:00')
            ->where('submissions.created_at <=', $tanggal . ' 23:59:59')
            ->findAll();
---
SELECT `submissions`.*, `documentcategories`.`name` as `document_name`, `documentcategories`.`requirements` as `requirements`, `documentcategories`.`category` as `document_category`, `admins`.`name` as `admin_name`, `admins`.`email` as `admin_email`, `admins`.`phone` as `admin_phone`, `identificationcards`.`place_of_birth`, `identificationcards`.`date_of_birth`, `identificationcards`.`nationality`, `identificationcards`.`identity_number`, `identificationcards`.`admin_id` as `id_admin`
FROM `submissions`
LEFT JOIN `documentcategories` ON `documentcategories`.`id` = `submissions`.`document_id`
LEFT JOIN `admins` ON `admins`.`id` = `submissions`.`admin_id`
LEFT JOIN `identificationcards` ON `identificationcards`.`admin_id` = `submissions`.`admin_id`
WHERE `submissions`.`created_at` >= '2025-05-04 00:00:00'
AND `submissions`.`created_at` <= '2025-05-04 23:59:59'

    public function kategori()
    {

        $kategori = $this->request->getPost('document_id');
        $dompdf = new Dompdf();
        $modelSubmision = new SubmissionModel();

        $submission = $modelSubmision->getWithDocuments()
            ->where('submissions.document_id', $kategori)
            ->findAll();
---
SELECT `submissions`.*, `documentcategories`.`name` as `document_name`, `documentcategories`.`requirements` as `requirements`, `documentcategories`.`category` as `document_category`, `admins`.`name` as `admin_name`, `admins`.`email` as `admin_email`, `admins`.`phone` as `admin_phone`, `identificationcards`.`place_of_birth`, `identificationcards`.`date_of_birth`, `identificationcards`.`nationality`, `identificationcards`.`identity_number`, `identificationcards`.`admin_id` as `id_admin`
FROM `submissions`
LEFT JOIN `documentcategories` ON `documentcategories`.`id` = `submissions`.`document_id`
LEFT JOIN `admins` ON `admins`.`id` = `submissions`.`admin_id`
LEFT JOIN `identificationcards` ON `identificationcards`.`admin_id` = `submissions`.`admin_id`
WHERE `submissions`.`document_id` = '3'