app/Controllers/Auth/Auth.php

    public function login()
    {
        // Cek apakah request method POST
        if ($this->request->getMethod() == 'POST') {
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $userModel = new AdminModel();
            $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `admins`
WHERE `email` = 'penduduk@example.com'
 LIMIT 1

    public function store(){
        $user = new AdminModel();
        $penduduk = new IdentificationCardModel();

        $dataUser = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone'),
            'role' => 'penduduk',
            'password' => password_hash($this->request->getPost('password'), PASSWORD_BCRYPT),
        ];

        $user->insert($dataUser);
        $akunID = $user->insertID(); // Dapatkan ID akun yang baru

        // Simpan data user ke tabel `users`
        $userData = [
            'admin_id' => $akunID,
            'identity_number' => $this->request->getPost('nik'),
            'place_of_birth' => $this->request->getPost('tempatlahir'),
            'date_of_birth' => $this->request->getPost('tanggallahir'),
            'religion' => $this->request->getPost('agama'),
            'marital_status' => $this->request->getPost('nikah'),
            'job' => $this->request->getPost('pekerjaan'),
            'nationality' => $this->request->getPost('kewarganegaraan'),
            'blood_type' => $this->request->getPost('goldar'),
            'addres' => $this->request->getPost('alamat'),
        ];
        $penduduk->insert($userData);
---
INSERT INTO `admins` (`name`, `email`, `phone`, `role`, `password`, `created_at`, `updated_at`) VALUES ('fajar ', 'fajar@gmail.com', '0926672637262', 'penduduk', '$2y$10$MOHmnNYGixj7e1qA5HUf3.CFXzRYLCOJ.vE9bVvEUvsZquaGqcKLe', '2025-04-30 13:57:46', '2025-04-30 13:57:46')
INSERT INTO `identificationcards` (`admin_id`, `identity_number`, `place_of_birth`, `date_of_birth`, `religion`, `marital_status`, `job`, `nationality`, `blood_type`, `addres`, `created_at`, `updated_at`) VALUES (6, '2100281127381231', 'cina', '1999-05-22', 'Islam', '1', 'wqwq', 'WNI', '-', 'fajar123\r\n', '2025-04-30 13:57:46', '2025-04-30 13:57:46')