app/Controllers/AdminController.php

    public function index()
    {
        $query = $this->request->getGet('query');
        if ($query) {
            $adminModel = new AdminModel();
            $data = $adminModel->where('name', 'like', '%' . $query . '%')->orWhere('role !=', 'penduduk')->findAll();
        } else {
            $adminModel = new AdminModel();
            $data = $adminModel->where('role !=', 'penduduk')->findAll();
---
SELECT *
FROM `admins`
WHERE `role` != 'penduduk'