app/Controllers/Home.php

    public function index(): string
    {
        $hasilModel = new HasilModel();
        $clusterData = $hasilModel->select('cluster, COUNT(*) as jumlah')
            ->groupBy('cluster')
            ->findAll();

        $identificationModel = new IdentificationCardModel();
        $identificationData = $identificationModel->countAll();

        $adminModel = new AdminModel();
        $adminData = $adminModel->where('role', 'front_office')->countAllResults();

        $submissionModel = new SubmissionModel();
        $submissionData = $submissionModel->countAll();

        // FO
        $submission['process'] = $submissionModel->where('status', 'process')->countAllResults();
        $submission['completed'] = $submissionModel->where('status', 'completed')->countAllResults();
        $submission['procesid'] = $submissionModel->where('status', 'process')->where('id', session()->get('id'))->countAllResults();
        $submission['completedid'] = $submissionModel->where('status', 'completed')->where('id', session()->get('id'))->countAllResults();
---
SELECT `cluster`, COUNT(*) as jumlah
FROM `hasils`
GROUP BY `cluster`
SELECT COUNT(*) AS `numrows` FROM `identificationcards`
SELECT COUNT(*) AS `numrows`
FROM `admins`
WHERE `role` = 'front_office'
SELECT COUNT(*) AS `numrows` FROM `submissions`
SELECT COUNT(*) AS `numrows`
FROM `submissions`
WHERE `status` = 'process'
SELECT COUNT(*) AS `numrows`
FROM `submissions`
WHERE `status` = 'completed'
SELECT COUNT(*) AS `numrows`
FROM `submissions`
WHERE `status` = 'process'
AND `id` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `submissions`
WHERE `status` = 'completed'
AND `id` IS NULL