app/Controllers/KategoriController.php

    public function index()
    {
        $documentModel = new DocumentCategorieModel();
        $data['documents'] = $documentModel->findAll();
---
SELECT *
FROM `documentcategories`