app/Controllers/PengajuanController.php

SELECT `submissions`.*, `documentcategories`.`name` as `document_name`, `documentcategories`.`requirements` as `requirements`, `documentcategories`.`category` as `document_category`, `admins`.`name` as `admin_name`, `admins`.`email` as `admin_email`, `admins`.`phone` as `admin_phone`, `identificationcards`.`place_of_birth`, `identificationcards`.`date_of_birth`, `identificationcards`.`nationality`, `identificationcards`.`identity_number`, `identificationcards`.`admin_id` as `id_admin`
FROM `submissions`
LEFT JOIN `documentcategories` ON `documentcategories`.`id` = `submissions`.`document_id`
LEFT JOIN `admins` ON `admins`.`id` = `submissions`.`admin_id`
LEFT JOIN `identificationcards` ON `identificationcards`.`admin_id` = `submissions`.`admin_id`
WHERE `submissions`.`status` = 'completed'
SELECT `submissions`.*, `documentcategories`.`name` as `document_name`, `documentcategories`.`requirements` as `requirements`, `documentcategories`.`category` as `document_category`, `admins`.`name` as `admin_name`, `admins`.`email` as `admin_email`, `admins`.`phone` as `admin_phone`, `identificationcards`.`place_of_birth`, `identificationcards`.`date_of_birth`, `identificationcards`.`nationality`, `identificationcards`.`identity_number`, `identificationcards`.`admin_id` as `id_admin`
FROM `submissions`
LEFT JOIN `documentcategories` ON `documentcategories`.`id` = `submissions`.`document_id`
LEFT JOIN `admins` ON `admins`.`id` = `submissions`.`admin_id`
LEFT JOIN `identificationcards` ON `identificationcards`.`admin_id` = `submissions`.`admin_id`
WHERE `submissions`.`status` = 'process'
AND `submissions`.`admin_id` = '3'
---
    public function index()
    {
        $submissionModel = new SubmissionModel();
        $uri = service('uri');
        $lastSegment = $uri->getSegment($uri->getTotalSegments());
        $adminId = session()->get('admin_id');
        $role = session()->get('role');

        // Default nilai $pengajuan sebagai array kosong untuk menghindari error
        $pengajuan = [];

        if ($role == 'front_office') {
            $pengajuan = $submissionModel->getWithDocuments()
                ->where('submissions.status', $lastSegment) // Pakai prefix tabel
                ->findAll();
        } elseif ($role == 'penduduk') {
            $pengajuan = $submissionModel->getWithDocuments()
                ->where('submissions.status', $lastSegment) // Pakai prefix tabel
                ->where('submissions.admin_id', $adminId) // Pakai prefix tabel
                ->findAll();

SELECT *
FROM `documentcategories`
---
    public function create()
    {
        $documentModel = new DocumentCategorieModel();
        $documents = $documentModel->findAll();

SELECT *
FROM `documentcategories`
WHERE `documentcategories`.`id` = '2'
---
    public function getRequirements()
    {
        $documentModel = new DocumentCategorieModel();
        $documentId = $this->request->getPost('document_id');
        $document = $documentModel->find($documentId);

SELECT *
FROM `submissions`
WHERE `submissions`.`id` = '11'
UPDATE `submissions` SET `status` = 'accepte'
WHERE `submissions`.`id` IN ('11')
---
    public function update($id)
    {
        $submissionModel = new SubmissionModel();
        $pengajuan = $submissionModel->find($id);

        if (!$pengajuan) {
            return redirect()->back()->with('error', 'Data tidak ditemukan');
        }

        if ($pengajuan['status'] == 'process') {
            $submissionModel->update($id, ['status' => 'accepte']);